app/views/tasks/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."task_id" = $1  [["task_id", 1]]
---

<% @task.comments.each do |comment| %>