app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "MyProject"], ["user_id", 1], ["created_at", "2018-01-09 13:55:19.443119"], ["updated_at", "2018-01-09 13:55:19.443119"]]
---
  def create
    @project = Project.new(project_params)
    @project.user = current_user

    respond_to do |format|
      if @project.save