app/controllers/tasks_controller.rb

  def new
    @task = Task.new
     @project_options = current_user.projects.map{|p| [ p.name, p.id ] }
---
SELECT "projects"."id" FROM "projects" WHERE "projects"."user_id" = $1  [["user_id", 1]]

  def create
    @task = Task.new(task_params)
    @task.user = current_user
    @task.status = false

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("name", "text", "user_id", "status", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "fsd"], ["text", "fds"], ["user_id", 1], ["status", "f"], ["project_id", 3], ["created_at", "2018-01-10 17:40:34.252058"], ["updated_at", "2018-01-10 17:40:34.252058"]]

    def set_task
      @task = Task.find(params[:id])
 @project_options = current_user.projects.map{|p| [ p.name, p.id ] }
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1  [["user_id", 1]]